/* Initial login prompt for username and password */
"Login {0} with username and password" = "Sisäänkirjautuminen käyttäjätunnuksella ja salasanalla";

/* Lookup of password in Keychain */
"No login credentials could be found in the Keychain" = "Sisäänkirjautumisen valtuutuksia ei löytynyt Avainnipusta";
"The use of the Keychain is disabled in the Preferences" = "Avainnipun käyttä on estetty Järjestelmäasetuksissa";

/* Password proctected private key for SSH public key authentication */
"Invalid passphrase" = "Virheellinen tunnuslause";
"Private key password protected" = "Henkilökohtaisen avaimen salasaja suojattu";
"Enter the passphrase for the private key file" = "Anna salauslause henkilökohtaiselle avaintiedostolle";

"Login canceled" = "Sisäänkirjautuminen kumottu";
"Login failed" = "Sisäänkirjautuminen epäonnistui";
"Login successful" = "Sisäänkirjautuminen onnistui";

/* Private key selection for SSH public key authentication */
"Select the private key in PEM or PuTTY format" = "Valitse PEM-muotoinen henkilökohtainen avain";

/* Challenge-Respone authentication */
"Partial authentication success" = "Osittainen onnistuminen tunnistamisessa";
"Provide additional login credentials" = "Anna lisäkirjautumistietoja";

/* Login prompt placeholders */
"Username" = "Käyttäjätunnus";
"Password" = "Salasana";

/* Warning when credentials are sent using unsecured protocol. Unsecure FTP connection */
"Unsecured {0} connection" = "Suojaton {0} yhteys";

/* Credentials sent over plaintext connection */
"{0} will be sent in plaintext." = "{0} lähtetään pelkkänä tekstinä.";
"Don't show again" = "Älä näytä uudelleen";
"Continue" = "Jatka";
"Disconnect" = "Katkaise yhteys";

/* Protocol switch proposal */
"The server supports encrypted connections. Do you want to switch to {0}?" = "Palvelin mahdollistaa suojatun yhteyden. Haluatko vaihtaa käyttämään {0} protokollaa?";
"Change" = "Vaihda";

/* OAuth2 */
"Paste the authentication code from your web browser" = "Sijoita todennuskoodi selaimestasi";
"Open web browser to authenticate and obtain an authorization code" = "Avaa selain jotta voit autentikoitua ja hakea todennuskoodin";
"Authentication Code" = "Authentication Code";

"Create a passphrase required to access {0}" = "Create a passphrase required to access {0}";
